# BarNominalDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBarType..::..BarNominalDiameter Property
RebarBarType Class See Also
---
Defines bar nominal diameter of rebar
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double BarNominalDiameter { get; set; }
```

Visual Basic
---
```text
Public Property BarNominalDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
```

# ### Field Value
The bar nominal diameter of rebar
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: the bar diameter barNominalDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter, standard hook bend diameter and stirrup/tie bend diameter |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace